<template>
  <div class="defaultPadding">
    <a-space :style="{ position: 'absolute', top: '200px', left: '82%' }">
      <span>颜色维度：</span>
      <a-select v-model="type" placeholder="请选择" @change="changeType" style="width: 120px">
        <a-option v-for="item in typeList" :value="item.label" :key="item.label">{{ item.value }}</a-option>
      </a-select>
    </a-space>
    <scatterPlot :seriesData="data" :color="color" />
  </div>
</template>
<script setup>
import { onMounted, ref } from "vue";
import scatterPlot from "@/components/scatterPlot.vue";
// 颜色维度列表
const typeList = ref([
  {
    label: 1,
    value: "满勤",
  },
  {
    label: 2,
    value: "入职日期",
  },
]);
// 颜色维度
const type = ref(1);
// 数据
const data = ref([]);
// 颜色种类
const color = ref([]);
// 调接口
const getList = value => {
  if (value === 1) {
    data.value = [
      {
        name: "满勤",
        data: [
          [2, 0.2, "赵四"],
          [4, 1.2, "王五"],
          [6, 0.6, "赵四"],
          [7, 0.4, "王五"],
          [20, 1.6, "赵四"],
          [40, 0.8, "王五"],
          [50, 1.8, "赵四"],
          [80, 2.3, "王五"],
          [83, 0.8, "赵四"],
          [90, 0.8, "王五"],
        ],
      },
      {
        name: "缺勤1天",
        data: [
          [2, 0.7, "王五"],
          [1, 1.2, "王五"],
          [7, 0.6, "王五"],
          [9, 0.4, "赵四"],
          [11, 1.8, "王五"],
          [23, 0.8, "王五"],
          [40, 1.3, "赵四"],
          [70, 0.3, "王五"],
          [93, 2.4, "王五"],
          [97, 0.8, "王五"],
        ],
      },
      {
        name: "缺勤2天",
        data: [
          [2, 0.4, "张三"],
          [6, 1.2, "张三"],
          [10, 0.6, "张三"],
          [17, 0.4, "王五"],
          [19, 1.8, "张三"],
          [23, 1.4, "张三"],
          [47, 1.3, "张三"],
          [80, 2.5, "赵四"],
          [97, 2.4, "张三"],
          [99, 2.3, "张三"],
        ],
      },
      {
        name: "缺勤3天",
        data: [
          [1, 0.4, "张三"],
          [5, 1.2, "张三"],
          [11, 0.6, "张三"],
          [20, 0.4, "王五"],
          [21, 1.8, "张三"],
          [27, 1.4, "张三"],
          [56, 1.3, "张三"],
          [72, 2.5, "赵四"],
          [81, 2.3, "张三"],
          [96, 2.3, "张三"],
        ],
      },
    ];
    color.value = ["#503e6a", "#fec42c", "#f96f0d", "#dd4444"];
  } else {
    data.value = [
      {
        name: "0-1个月",
        data: [
          [2, 0.2],
          [4, 1.2],
          [6, 0.6],
          [7, 0.4],
          [20, 1.6],
          [40, 0.8],
          [50, 1.8],
          [80, 2.3],
          [83, 0.8],
          [90, 0.8],
        ],
      },
      {
        name: "1-3个月",
        data: [
          [2, 0.7, "赵四"],
          [1, 1.2, "赵四"],
          [7, 0.6, "赵四"],
          [9, 0.4, "赵四"],
          [11, 1.8, "赵四"],
          [23, 0.8, "赵四"],
          [40, 1.3, "赵四"],
          [70, 0.3, "赵四"],
          [93, 2.4, "赵四"],
          [97, 0.8, "赵四"],
        ],
      },
      {
        name: "3-6个月",
        data: [
          [2, 0.4, "赵四"],
          [6, 1.2, "赵四"],
          [10, 0.6, "赵四"],
          [17, 0.4, "赵四"],
          [19, 1.8, "赵四"],
          [23, 1.4, "赵四"],
          [47, 1.3, "赵四"],
          [80, 2.5, "赵四"],
          [97, 2.4, "赵四"],
          [99, 2.3, "赵四"],
        ],
      },
      {
        name: "6-12个月",
        data: [
          [1, 0.4, "赵四"],
          [5, 1.2, "赵四"],
          [11, 0.6, "赵四"],
          [20, 0.4, "赵四"],
          [21, 1.8, "赵四"],
          [27, 1.4, "赵四"],
          [56, 1.3, "赵四"],
          [72, 2.5, "赵四"],
          [89, 2.4, "赵四"],
          [96, 2.3, "赵四"],
        ],
      },
      {
        name: "1-3年",
        data: [
          [2.3, 0.4, "赵四"],
          [5.5, 1.2, "赵四"],
          [11.8, 0.6, "赵四"],
          [20.6, 0.4, "赵四"],
          [21.3, 1.8, "赵四"],
          [27.8, 1.4, "赵四"],
          [56.3, 1.3, "赵四"],
          [72.1, 2.5, "赵四"],
          [86.4, 2.4, "赵四"],
          [96.5, 2.3, "赵四"],
        ],
      },
      {
        name: "3年以上",
        data: [
          [1.5, 0.4, "赵四"],
          [5.7, 1.2, "赵四"],
          [11.6, 0.9, "赵四"],
          [20.7, 0.8, "赵四"],
          [21.4, 1.3, "赵四"],
          [27.0, 1, "赵四"],
          [56, 1.3, "赵四"],
          [45, 2.5, "赵四"],
          [74, 2.4, "赵四"],
          [100, 2.3, "赵四"],
        ],
      },
    ];
    color.value = ["#f6d91d", "#fec42c", "#fb954d", "#f6682c", "#f81313", "#7d1d07"];
  }
  var itemStyle = {
    //设置圆形的样式
    shadowBlur: 10,
    shadowColor: "rgba(120, 36, 50, 0.5)",
    shadowOffsetY: 5,
  };
  data.value.forEach(item => {
    item.type = "scatter";
    item.itemStyle = itemStyle;
    item.symbolSize = 15;
  });
};
getList(type.value);
// 更改颜色维度
const changeType = value => {
  type.value = value;
  getList(value);
};
onMounted(() => {});
</script>
